/*
1. Напишитепредикат p(+X, +N, -L) - истинныйтогда итолько тогда,
когда L - список из N раз повторенных элементов X.

Тест:
p(a,0, []).
L = [].

p(a,1,[]).
L = [a].

p(a,2,[]).
L = [a,a].
*/

% Задача 1

p(X,N,L):-
    N>0,
    N1 is N -1,
    p(X,N1,L).

p(X,0,L):-
    add(X,L,L).

add(H,T,[H|T]).


/*
2. Напишитепредикат p(+L, -S)  -   истинныйтогдаитолькотогда,
когда S - список списков элементовсписка L, 
например, p([a, b, c],[[a], [b], [c]]) - исти-на

tests:
p2([],L).
L=[].

p2([a],L).
L=[[a]]

p2([a,b],L).
L=[[a],[b]].

*/

% (2)

p2([],[]).

p2(L,L1):-
    p2(L,[],L1).

p2([],L,L):-
    inverse(L,L1).

p2([H|T], L2, L1):-
    p2(T, [[H]|L2], L1).


inverse(L,L1):-
    inverse(L,[],L1).

inverse([],L,L).
inverse([H|T],L2,L1):-
    inverse(T, [H|L2],L1).


