/*
Вариант 5.

1. Определите отношение sum_tree(+TreeOfInteger, -Sum), выполненное, если
число Sum равно сумме целых чисел, являющихся вершинами дерева
TreeOfInteger.


*/


/*
2. Определим операторы:
:- op( 100, fy, ~).
:- op( 110, xfy, &).
:- op( 120, xfy, v).
Булева формула есть терм, определяемый следующим образом: константы
true и false - булевы формулы; если X и Y - булевы формулы, то и X v Y, X &
Y, ~X - булевы формулы, здесь v и & - бинарные инфиксные операторы
дизъюнкции и конъюнкции, а ~ - унарный оператор отрицания. Напишите
предикат p(+T), определяющий, является ли данный терм T булевой форму-
лой.
*/